[
  "Mình có thể hỗ trợ, nhưng câu hỏi của bạn còn hơi chung chung. Bạn cho mình thêm vài chi tiết để tư vấn đúng nhé.",
  "Bạn mô tả giúp mình cụ thể hơn một chút được không (đang trồng/nuôi gì, tình trạng như thế nào, xuất hiện bao lâu rồi)?",
  "Để mình tư vấn chính xác, bạn cho mình biết: đối tượng (cây/vật nuôi), khu vực, và dấu hiệu/triệu chứng chính nhé.",
  "Bạn có thể gửi thêm thông tin (hoặc ảnh/video) về tình trạng hiện tại không? Như vậy mình sẽ chẩn đoán sát hơn.",
  "Bạn cho mình biết thêm: giống/độ tuổi/giai đoạn, điều kiện chăm sóc và các dấu hiệu bất thường bạn thấy nhé.",

  "Mình hiểu ý bạn. Bạn đang gặp vấn đề ở cây trồng hay vật nuôi/ao nuôi? Cho mình 1–2 chi tiết để mình đi đúng hướng nhé.",
  "Bạn cho mình hỏi thêm vài câu để chẩn đoán nhanh: xảy ra bao lâu, mức độ nặng nhẹ, và bạn đã xử lý gì chưa?",
  "Mình sẵn sàng tư vấn. Bạn cho mình biết đối tượng + triệu chứng chính + thời gian xuất hiện nhé.",
  "Câu hỏi này cần thêm dữ kiện. Bạn giúp mình: (1) trồng/nuôi gì, (2) ở đâu, (3) vấn đề cụ thể là gì, (4) xuất hiện bao lâu rồi?",
  "Bạn có thể nói rõ hơn: số lượng bị ảnh hưởng (mấy cây/mấy con), và có thay đổi thời tiết/nước/khẩu phần gần đây không?",

  "Nếu là cây trồng: bạn cho mình biết loại cây, giai đoạn (cây con/ra hoa/đậu trái), và biểu hiện trên lá/thân/rễ nhé.",
  "Nếu là vật nuôi: bạn cho mình biết loài, độ tuổi, triệu chứng (ăn uống, phân, hô hấp), và tỉ lệ con bị nhé.",
  "Nếu là ao nuôi: bạn cho mình biết pH/kiềm/DO/nhiệt độ (nếu có), màu nước, và hiện tượng của tôm/cá nhé.",

  "Bạn cho mình xin 1 ảnh cận cảnh (lá/bệnh) hoặc ảnh tổng quan vườn/chuồng/ao để mình nhận diện nhanh hơn nhé.",
  "Bạn nói rõ giúp mình mục tiêu bạn muốn: phòng bệnh, xử lý cấp cứu hay tối ưu dinh dưỡng/kỹ thuật?",
  "Bạn đang muốn giải quyết theo hướng sinh học/an toàn hay có thể dùng thuốc? Mình sẽ gợi ý theo hướng bạn ưu tiên.",

  "Ok bạn. Mình cần thêm 3 thông tin: đối tượng, triệu chứng, và thời gian xảy ra. Bạn trả lời giúp mình nha.",
  "Bạn mô tả kỹ hơn một chút: biểu hiện cụ thể là gì (vàng lá, héo, đốm, rụng, bỏ ăn, tiêu chảy...), và mức độ ra sao?",
  "Bạn đang ở tỉnh/thành nào? Điều kiện thời tiết/nguồn nước mỗi vùng khác nhau nên tư vấn sẽ khác đó.",
  "Bạn đã dùng loại phân/thuốc nào gần đây chưa? Nếu có, cho mình biết tên và liều lượng để tránh tương tác/nhầm nguyên nhân nhé.",

  "Bạn có thể viết theo mẫu này để mình tư vấn nhanh: Đối tượng – Giai đoạn/độ tuổi – Triệu chứng – Thời gian – Điều kiện (nước/đất/chuồng) – Bạn đã xử lý gì.",

  "Mình hiểu vấn đề rồi. Bạn cho mình xin thêm 2–3 thông tin quan trọng để mình tư vấn đúng hướng nhé.",
  "Bạn cho mình biết cụ thể hơn một chút: bạn đang trồng/nuôi gì và gặp dấu hiệu gì rõ nhất?",
  "Để tránh tư vấn sai, bạn bổ sung giúp mình vài chi tiết (đối tượng, giai đoạn/độ tuổi, triệu chứng, thời gian) nhé.",
  "Bạn mô tả giúp mình theo dạng: ‘Đang trồng/nuôi …, hiện tượng …, xảy ra … ngày’ là mình tư vấn được ngay.",
  "Bạn cho mình xin thêm: số lượng bị (bao nhiêu cây/con), mức độ nặng nhẹ, và có lan nhanh không nhé.",
  "Bạn đang cần tư vấn về xử lý nhanh (cấp cứu) hay xử lý gốc rễ lâu dài? Cho mình biết để mình ưu tiên.",
  "Bạn cho mình biết địa điểm/khu vực (tỉnh/thành) và điều kiện thời tiết gần đây (mưa/nắng) nhé.",
  "Bạn đã thử xử lý gì chưa (bón phân/phun thuốc/thay nước/đổi cám)? Nếu có, nói giúp mình để mình tránh hướng sai.",
  "Bạn có thể gửi 1–2 ảnh rõ nét (cận cảnh + tổng quan) được không? Mình sẽ nhận diện nhanh hơn.",
  "Bạn có số đo nào không (pH, EC, kiềm, DO, nhiệt độ…)? Nếu có thì gửi mình nhé.",

  "Cho mình hỏi thêm: vấn đề xuất hiện từ khi nào và trước đó có thay đổi gì (thời tiết, nguồn nước, khẩu phần, phân/thuốc)?",
  "Bạn đang trồng/nuôi theo quy mô nào (chậu/luống/vườn; ao/bể/chuồng)? Thông tin này giúp mình đưa khuyến nghị sát hơn.",
  "Bạn ưu tiên hướng xử lý ‘an toàn/sinh học’ hay có thể dùng thuốc? Mình sẽ tư vấn theo ưu tiên của bạn.",
  "Bạn mô tả kỹ giúp mình phần ‘triệu chứng’: màu sắc, vị trí (lá non/lá già, thân/rễ), có mùi hay dịch không nhé.",
  "Bạn cho mình biết thêm về chế độ chăm sóc hiện tại (tưới, bón, mật độ, thay nước, thông gió…) nhé.",
  "Mình cần thêm dữ kiện để chẩn đoán đúng: có dấu hiệu nào kèm theo (bỏ ăn, phân bất thường, nổi đầu, héo rũ…) không?",
  "Bạn cho mình xin thời gian xảy ra (mấy ngày/tuần) và diễn biến (nặng dần hay ổn định) nhé.",
  "Bạn có thể cho mình biết giống/loại cụ thể (giống cây, loài nuôi) và giai đoạn hiện tại không?",
  "Bạn cho mình biết môi trường: đất (pH/độ ẩm/thoát nước) hoặc nước ao (màu nước/mùi/độ trong) nhé.",
  "Bạn gửi giúp mình thông tin về mật độ/khối lượng đàn (mật độ thả, số con, trọng lượng ước tính) nếu có nhé.",

  "Mình có thể tư vấn ngay khi bạn cho mình 3 ý: ‘đối tượng – hiện tượng – thời gian’ nhé.",
  "Bạn cho mình biết đây là vấn đề trên lá, thân, rễ hay trái (nếu cây trồng) để mình khoanh vùng nguyên nhân.",
  "Nếu vật nuôi: bạn cho mình biết có sốt/khò khè/tiêu chảy/bỏ ăn không và tỉ lệ con bị khoảng bao nhiêu nhé.",
  "Nếu ao nuôi: bạn cho mình biết pH sáng/chiều, kiềm, DO, nhiệt độ (nếu có) và hiện tượng tôm/cá nhé.",
  "Bạn có thay đổi nguồn nước/loại thức ăn/loại phân gần đây không? Chi tiết này rất quan trọng.",
  "Bạn cho mình biết mục tiêu chính: tăng trưởng, phòng bệnh hay xử lý triệu chứng hiện tại?",
  "Bạn mô tả giúp mình mức độ: nhẹ (vài cây/con) hay nặng (lan rộng), và có chết/rụng nhiều không?",
  "Bạn có thể cho mình biết thời điểm xuất hiện (sáng/chiều/tối, sau mưa, sau bón/phun) không?",
  "Bạn cho mình xin thêm 1–2 dấu hiệu nổi bật nhất (ví dụ: vàng lá gân xanh, đốm nâu, héo rũ…) nhé.",
  "Bạn đã kiểm tra/đo thử gì chưa? Nếu có kết quả test, gửi mình để mình suy luận nhanh.",

  "Mình muốn hỏi thêm để tư vấn đúng: bạn đang xử lý theo hướng nào và bạn kỳ vọng kết quả trong bao lâu?",
  "Bạn cho mình biết tình trạng này xảy ra trên diện rộng hay chỉ 1 khu vực/1 góc ao/1 dãy chuồng?",
  "Bạn có thể cho mình biết lịch bón/phun gần đây (tên sản phẩm + liều) để mình loại trừ ngộ độc/pha liều cao không?",
  "Bạn cho mình xin điều kiện ánh sáng/nhiệt độ (đặc biệt nếu trồng nhà lưới/chậu) nhé.",
  "Bạn có dùng thuốc/kháng sinh/hoá chất gần đây không? Nếu có, nói rõ để mình tránh khuyến nghị trùng lặp.",
  "Bạn cho mình biết nguồn nước (giếng/nước máy/kênh) và lịch thay nước (nếu ao/bể) nhé.",
  "Bạn cho mình xin thêm: mùi (hôi/tanh), màu (xanh/nâu/đục) và độ trong (cm) nếu là ao nuôi nhé.",
  "Bạn cho mình biết bạn muốn giải pháp theo kiểu ‘từng bước làm ngay’ hay ‘phân tích nguyên nhân + kế hoạch’ nhé.",
  "Bạn mô tả giúp mình: trước đó bình thường, sau sự kiện gì thì bắt đầu (mưa, thay nước, đổi cám, bón phân…)?",
  "Bạn cho mình xin thêm thông tin về vệ sinh/khử trùng/đệm lót (nếu chuồng trại) để mình tư vấn giảm mùi và bệnh hô hấp.",

  "Bạn cho mình biết thời điểm bón/phun gần nhất cách đây bao lâu?",
  "Bạn có thấy côn trùng/rụp/rệp/bọ trĩ… trên lá không? Nếu có thì mô tả hoặc gửi ảnh.",
  "Bạn quan sát giúp mình: lá bị ở mặt trên hay mặt dưới, có mốc/phấn trắng không?",
  "Bạn cho mình biết cây/vật nuôi ở giai đoạn nào (con giống/cây con, ra hoa, đậu trái, vỗ béo, đẻ…) nhé.",
  "Bạn cho mình xin thêm: tốc độ lan (1 ngày lan 1 ít hay lan rất nhanh) để mình phân biệt bệnh sinh lý vs bệnh hại.",
  "Bạn cho mình biết có kèm dấu hiệu rễ yếu/thối, đất úng hay khô kéo dài không?",
  "Bạn có thể cho mình biết pH đất/nước gần đây có biến động không?",
  "Bạn cho mình xin thêm số liệu (nếu có): EC, TDS, độ mặn, kiềm, NH3/NO2…",
  "Bạn mô tả giúp mình khẩu phần/thức ăn hiện tại (loại cám, lượng cho ăn, số cữ) nếu là vật nuôi/thuỷ sản nhé.",
  "Bạn cho mình biết tỉ lệ bị ảnh hưởng (ước % hoặc số lượng) để mình đánh giá mức độ.",

  "Mình sẽ hỏi nhanh 4 ý để tư vấn chuẩn: (1) đối tượng, (2) triệu chứng, (3) thời gian, (4) bạn đã làm gì rồi.",
  "Bạn cho mình biết bạn đang ưu tiên ‘chữa ngay’ hay ‘phòng dài hạn’?",
  "Bạn cho mình xin thêm 1 câu mô tả ngắn: ‘ở đâu – cái gì – bị làm sao’ nhé.",
  "Bạn có thể gửi ảnh ở chỗ bị nặng nhất và chỗ còn bình thường để so sánh không?",
  "Bạn cho mình biết chế độ tưới/bón hiện tại và có thay đổi gì gần đây không?",
  "Bạn cho mình xin thêm: mật độ trồng/thả nuôi và lịch vệ sinh/thay nước (nếu có) nhé.",
  "Bạn cho mình biết đây là vấn đề cấp tính (mới xảy ra) hay mạn tính (kéo dài) nhé.",
  "Bạn có phát hiện mùi bất thường, bọt, nhớt, tảo tàn… không (nếu ao/bể)?",
  "Bạn cho mình xin thêm: môi trường chuồng có gió lùa/ẩm/nóng không (nếu vật nuôi)?",
  "Bạn mô tả thêm: biểu hiện xuất hiện sau ăn, sau mưa, hay sau bón/phun không?",

  "Mình muốn hỗ trợ sát nhất. Bạn cho mình biết bạn đang gặp khó ở ‘kỹ thuật’, ‘dinh dưỡng’, hay ‘bệnh hại’ nhé.",
  "Bạn cho mình xin thêm thông tin về lịch gieo trồng/thả nuôi (ngày bắt đầu) nếu bạn nhớ.",
  "Bạn cho mình biết mục tiêu năng suất/sản lượng hoặc quy mô để mình gợi ý giải pháp phù hợp.",
  "Bạn có thể cho mình biết bạn muốn dùng vật tư phổ biến/dễ mua hay phương án tối ưu chi phí?",
  "Bạn cho mình xin thêm: thời tiết 3–5 ngày gần đây (mưa/nắng/nhiệt độ) vì ảnh hưởng nhiều đến bệnh.",
  "Bạn mô tả giúp mình tình trạng nước/đất hiện tại và bạn quản lý thế nào (thay nước, bón vôi, vi sinh…).",
  "Bạn cho mình biết bạn đang canh tác theo hướng hữu cơ/VietGAP hay thông thường để mình tư vấn đúng tiêu chí nhé.",
  "Bạn cho mình xin thêm: có xuất hiện đồng loạt hay chỉ vài điểm rải rác?",
  "Bạn cho mình biết bạn có thể đo/kiểm tra gì được (pH, nhiệt, độ mặn…) để mình hướng dẫn theo khả năng của bạn.",
  "Bạn cho mình xin 1–2 con số bất kỳ bạn đang có (ví dụ pH/kiềm/EC) là mình suy luận nhanh hơn.",

  "Bạn cho mình xin thêm: loại phân/thuốc bạn đang dùng và lần cuối dùng cách đây bao lâu nhé.",
  "Bạn mô tả giúp mình: lá bị vàng ở lá già hay lá non? Có gân xanh không?",
  "Bạn cho mình biết có thấy đốm/hình dạng vết bệnh (tròn, thoi, loang) không?",
  "Bạn cho mình xin thêm: rễ có bị thối/mùi hôi không (nếu cây)?",
  "Bạn cho mình biết cây/vật nuôi đang ở giai đoạn nhạy cảm nào (ra hoa, đậu trái, sau thả nuôi…) nhé.",
  "Bạn cho mình biết có dùng thuốc cỏ/thuốc trừ sâu gần khu vực đó không?",
  "Bạn cho mình xin thêm: nước ao có đổi màu đột ngột không và tôm/cá có nổi đầu vào khung giờ nào?",
  "Bạn mô tả giúp mình: phân/đường ruột/khả năng bắt mồi (nếu tôm/cá) như thế nào?",
  "Bạn cho mình biết đàn có đồng loạt bỏ ăn hay chỉ vài con?",
  "Bạn cho mình xin thêm: đã tiêm phòng gì, lần tiêm gần nhất khi nào (nếu gia cầm/heo) nhé.",

  "Bạn trả lời giúp mình 3 câu: đang trồng/nuôi gì, triệu chứng gì, và bao lâu rồi?",
  "Mình sẽ tư vấn theo bước. Bạn cho mình xin thêm thông tin đầu vào để mình không bị đoán mò nhé.",
  "Bạn cho mình xin thêm 1–2 chi tiết nhỏ thôi cũng được, rồi mình sẽ gợi ý hướng xử lý ngay.",
  "Bạn cho mình biết tình trạng này ảnh hưởng phần nào nhiều nhất (tăng trưởng, sản lượng, chết/rụng) nhé.",
  "Bạn mô tả giúp mình ‘trước–sau’: trước đó bình thường, sau đó có sự kiện gì thì bắt đầu?",
  "Bạn cho mình biết mục tiêu: muốn lời khuyên chung hay muốn phác đồ/qui trình cụ thể?",
  "Bạn cho mình xin thêm: bạn đang canh tác/nuôi theo cách nào (truyền thống, công nghiệp, bán thâm canh…)?",
  "Bạn cho mình biết bạn có sẵn vật tư nào (vôi/vi sinh/khoáng/thuốc) để mình ưu tiên giải pháp phù hợp.",
  "Bạn cho mình xin thêm thông tin về nguồn bệnh/nguồn giống (mới mua/đã nuôi lâu) nếu có nhé.",
  "Bạn gửi giúp mình 1 câu mô tả đầy đủ hơn là mình tư vấn chính xác ngay.",

  "Riêng phần NƯỚC AO, bạn cho mình xin: màu nước + độ trong (cm) + mùi + bọt + pH sáng/chiều (nếu có) nhé.",
  "Bạn đang muốn xử lý nước ao theo hướng ‘làm trong’, ‘giảm tảo’, hay ‘giảm khí độc’? Cho mình biết để mình đi đúng hướng.",
  "Bạn cho mình xin diện tích ao và độ sâu trung bình (ước lượng) để mình tư vấn liều lượng/vật tư phù hợp.",
  "Bạn có đo được DO lúc rạng sáng (4–6h) không? Đây là chỉ số quan trọng khi nước ao xanh/tảo dày.",
  "Bạn cho mình xin pH sáng và pH chiều (nếu có), để mình đánh giá dao động pH do tảo.",
  "Nước ao xanh là xanh rêu hay xanh đậm? Độ trong khoảng bao nhiêu cm? Mình cần 2 thông tin này để phân biệt tảo dày hay chỉ gây màu nhẹ.",
  "Bạn có thấy bọt trắng/nhớt/váng mặt không? Nếu có thì mô tả giúp mình để mình xác định hữu cơ cao hay tảo.",
  "Bạn cho mình xin thêm: gần đây có mưa lớn/thay nước/tạt vôi/diệt tảo/đánh vi sinh gì không?",
  "Nếu mục tiêu là xử lý nước ao, bạn cho mình biết bạn đang có sẵn vật tư gì (vôi, dolomite, soda, zeolite, vi sinh, mật đường) nhé.",
  "Bạn cho mình biết độ trong (cm) đo bằng đĩa Secchi (hoặc ước lượng) để mình tư vấn ổn định tảo.",

  "Bạn mô tả giúp mình: nước đang xanh/đục/nâu/đen, có mùi không, và xuất hiện từ khi nào?",
  "Bạn có test NH3/NO2 không? Nếu có, gửi kết quả để mình hướng dẫn xử lý khí độc đúng.",
  "Bạn cho mình xin nhiệt độ và độ mặn (nếu có) vì ảnh hưởng đến pH/kiềm và độc tính NH3.",
  "Bạn cho mình xin kiềm hiện tại (ppm CaCO3) để mình hướng dẫn tăng/giảm kiềm an toàn.",
  "Bạn cho mình biết ao có quạt nước/sục khí không và đang chạy mấy giờ/ngày?",
  "Bạn có siphon đáy/thu gom bùn đáy định kỳ không? Nếu đáy hôi/đen thì cần xử lý khác nước xanh.",
  "Bạn cho mình biết nguồn nước cấp (giếng/kênh/sông) và bạn thay nước bao nhiêu % mỗi lần?",
  "Bạn cho mình xin mô tả bọt: bọt nổi quanh quạt hay ở góc ao? Bọt tan nhanh hay dai?",
  "Bạn cho mình biết mùi: tanh/hôi/trứng thối… để mình phân biệt khí độc và hữu cơ.",
  "Bạn muốn hướng xử lý ‘an toàn, ít sốc’ hay ‘xử lý nhanh’? Mình sẽ gợi ý theo ưu tiên.",

  "Bạn cho mình xin thêm 3 số liệu tối thiểu để tư vấn nước ao: pH sáng/chiều, kiềm, và DO sáng.",
  "Bạn có thể gửi ảnh mặt nước (màu nước) và ảnh đáy ao (nếu nhìn thấy) để mình đánh giá nhanh không?",
  "Bạn cho mình biết thời điểm nước ao bắt đầu xanh/đục: sau mưa, sau thay nước, hay sau cho ăn mạnh?",
  "Bạn cho mình xin độ trong mục tiêu bạn muốn (ví dụ 25–35cm) để mình hướng dẫn ổn định tảo.",
  "Bạn đang xử lý nước ao để chuẩn bị thả giống hay đang trong quá trình nuôi? (chỉ cần trả lời ngắn)",

  "Nếu bạn chỉ hỏi ‘xử lý nước ao’ chung chung, bạn cho mình biết vấn đề chính là: tảo dày, khí độc, nước đục hay mùi hôi?",
  "Bạn có đo pH lúc chiều tối không? Nếu pH chiều quá cao thường do tảo, mình sẽ tư vấn theo hướng giảm tảo.",
  "Bạn cho mình biết nước ao có bị đổi màu nhanh trong 1–2 ngày không? Nếu có thì dễ là tảo tàn.",
  "Bạn cho mình xin thêm: độ trong (cm) + màu nước + pH sáng/chiều, là mình có thể đưa hướng xử lý cụ thể ngay.",
  "Bạn muốn mình hướng dẫn theo ‘quy trình 24h’ hay ‘kế hoạch 3–5 ngày’ để ổn định nước?",

  "Mình cần thêm 1 chút để không hỏi lạc đề: bạn đang gặp vấn đề ở NƯỚC (màu/mùi/pH/kiềm/khí độc) hay ở con nuôi?",
  "Bạn chỉ cần trả lời 2 ý: nước đang màu gì và có mùi/bọt không, là mình hướng dẫn bước đầu được rồi.",
  "Bạn cho mình biết hiện tại bạn có đang chạy quạt ban đêm không? Nếu DO thấp sáng thì cần ưu tiên oxy trước.",
  "Bạn cho mình xin pH sáng/chiều và kiềm để mình đánh giá nguy cơ sốc khi can thiệp (vôi/diệt tảo)."
]
