[
  {"text": "nước ao xanh", "label": 0},
  {"text": "cách xử lý nước ao", "label": 0},
  {"text": "tôm bỏ ăn là bị gì?", "label": 0},
  {"text": "pH ao 8.5, NH3 0.5, NO2 1.0 xử lý sao?", "label": 0},
  {"text": "gà con bị tiêu chảy phân trắng", "label": 0},
  {"text": "lúa bị vàng lá gân xanh", "label": 0},
  {"text": "cà phê rụng trái non sau mưa", "label": 0},
  {"text": "cách bón phân NPK cho cây sầu riêng", "label": 0},
  {"text": "cách trị nấm cho cây ớt", "label": 0},
  {"text": "heo bỏ ăn, sốt nhẹ, thở khó", "label": 0},

  {"text": "Ao tôm bị tảo phát triển mạnh, nước xanh đậm và có bọt. Mình muốn bạn phân tích nguyên nhân theo từng giả thuyết và đề xuất 2 phương án xử lý (ngắn hạn và dài hạn), kèm theo chỉ số mục tiêu cho pH, kiềm, DO, NH3, NO2. Nếu có rủi ro sốc tôm thì nêu cách giảm sốc.", "label": 1},
  {"text": "Hãy xây dựng một quy trình giám sát chất lượng nước ao nuôi tôm theo tuần: tiêu chí, ngưỡng cảnh báo, cách lấy mẫu, cách ghi log, và hành động ứng phó tương ứng.", "label": 1},
  {"text": "Mình cần so sánh 3 phương án xử lý nước ao (thay nước, men vi sinh, hóa chất) theo chi phí, rủi ro, và hiệu quả trong 7 ngày.", "label": 1},
  {"text": "Bạn giúp mình lập kế hoạch dinh dưỡng cho bò thịt 12 tháng, gồm khẩu phần theo giai đoạn, mục tiêu tăng trọng, và cách điều chỉnh khi thời tiết thay đổi.", "label": 1},
  {"text": "Phân tích tác động của biến đổi khí hậu đến năng suất lúa ở Đồng bằng sông Cửu Long và đề xuất chiến lược thích ứng cho nông hộ quy mô nhỏ.", "label": 1},
  {"text": "Hãy viết một báo cáo kỹ thuật: đánh giá rủi ro dịch bệnh trên trang trại gà 5.000 con, thiết kế quy trình biosecurity, lịch vaccine, và kế hoạch ứng phó khi bùng phát.", "label": 1},

  {"text": "Cho mình 3 phương án thiết kế hệ thống tưới nhỏ giọt cho 2ha xoài, hãy tính công suất bơm, đường kính ống, lưu lượng, và dự toán chi phí.", "label": 1},
  {"text": "Hãy soạn một kế hoạch kinh doanh 12 tháng cho mô hình nuôi cá rô phi tuần hoàn (RAS): phân tích thị trường, chi phí CAPEX/OPEX, điểm hòa vốn, rủi ro và KPI vận hành.", "label": 1},
  {"text": "Mình cần một checklist chẩn đoán bệnh cây theo kiểu cây quyết định: triệu chứng, nguyên nhân, cách xác nhận, biện pháp xử lý. Hãy mô tả rõ quy tắc phân nhánh.", "label": 1},

  {"text": "xin chào", "label": 0},
  {"text": "chào bạn", "label": 0},
  {"text": "hello", "label": 0},

  {"text": "Cây cam bị vàng lá và rụng quả, mình đã bón NPK 16-16-8 2 lần/tháng, đất pH 5.2, EC 1.8, tưới 2 ngày/lần, thời tiết mưa nhiều. Bạn chẩn đoán theo từng khả năng và đề xuất lộ trình xử lý trong 4 tuần.", "label": 1},

  {"text": "ao có bọt", "label": 0},
  {"text": "ao có mùi hôi", "label": 0},
  {"text": "ao bị đục", "label": 0},
  {"text": "tảo tàn", "label": 0},
  {"text": "tảo xanh dày", "label": 0},
  {"text": "tảo lam", "label": 0},
  {"text": "NH3 cao", "label": 0},
  {"text": "NO2 cao", "label": 0},
  {"text": "DO thấp", "label": 0},
  {"text": "kiềm thấp", "label": 0},
  {"text": "pH ao cao", "label": 0},
  {"text": "pH ao thấp", "label": 0},
  {"text": "nước ao nâu", "label": 0},
  {"text": "nước ao đen", "label": 0},
  {"text": "nước ao đỏ", "label": 0},
  {"text": "nước ao có nhớt", "label": 0},
  {"text": "nước ao có váng", "label": 0},
  {"text": "tôm nổi đầu", "label": 0},
  {"text": "tôm giảm ăn", "label": 0},
  {"text": "tôm phân trắng", "label": 0},
  {"text": "cá nổi đầu", "label": 0},
  {"text": "cá bỏ ăn", "label": 0},
  {"text": "cá lờ đờ", "label": 0},
  {"text": "gà khò khè", "label": 0},
  {"text": "gà chết rải rác", "label": 0},
  {"text": "heo tiêu chảy", "label": 0},
  {"text": "heo sốt", "label": 0},
  {"text": "bò chướng hơi", "label": 0},
  {"text": "dê bị ghẻ", "label": 0},
  {"text": "vịt đi phân xanh", "label": 0},
  {"text": "lúa bị rầy nâu", "label": 0},
  {"text": "lúa bị đạo ôn", "label": 0},
  {"text": "lúa bị lem lép hạt", "label": 0},
  {"text": "sầu riêng rụng bông", "label": 0},
  {"text": "sầu riêng vàng lá", "label": 0},
  {"text": "hồ tiêu chết nhanh", "label": 0},
  {"text": "cà phê vàng lá", "label": 0},
  {"text": "dưa leo bị sương mai", "label": 0},
  {"text": "ớt bị thán thư", "label": 0},
  {"text": "cà chua xoăn lá", "label": 0},
  {"text": "rau bị bọ nhảy", "label": 0},
  {"text": "rau bị rệp", "label": 0},

  {"text": "Ao 1.000m2 nước xanh rêu đậm, chiều pH 8.8 sáng 7.7, DO sáng 3.2mg/L. Có bọt nhẹ. Xin hướng dẫn ổn định tảo và giảm dao động pH.", "label": 1},
  {"text": "Ao 2.500m2 sau mưa pH giảm 7.0, kiềm 50, nước đục. Xin quy trình tăng kiềm và ổn định lại màu nước 24–48h.", "label": 1},
  {"text": "Nước ao có mùi hôi và đáy ao đen, test NH3 0.6ppm, NO2 1.0ppm. Xin hướng dẫn xử lý khí độc và cải tạo đáy theo từng bước.", "label": 1},
  {"text": "Ao có bọt trắng nhiều quanh quạt, nước hơi nhớt, độ trong 15cm. Bạn phân tích nguyên nhân theo 3 giả thuyết và cho checklist kiểm tra.", "label": 1},
  {"text": "Ao 800m2 pH chiều 9.0 vào chiều, sáng 7.6; kiềm 160. Nước xanh đậm. Xin hướng dẫn giảm pH an toàn và tránh tảo tàn.", "label": 1},
  {"text": "Ao 1.000m2 NO2 1.5ppm, pH 7.8, kiềm 90, nước xanh. Xin tư vấn xử lý NO2 + kế hoạch vi sinh 7 ngày.", "label": 1},
  {"text": "Ao 900m2 DO thấp lúc rạng sáng (2.9mg/L), ban ngày 6.5mg/L. Nước xanh rêu. Xin tư vấn lịch chạy quạt + mục tiêu DO theo giờ.", "label": 1},
  {"text": "Ao bị phèn, pH 6.5, kiềm 30, nước vàng. Xin hướng dẫn tạt vôi/dolomite theo bước và cảnh báo sốc.", "label": 1},
  {"text": "Tôm thẻ 30 ngày tuổi bị mềm vỏ, chậm lớn; kiềm 80. Xin tư vấn bổ sung khoáng Ca/Mg, lịch tạt và chỉ số mục tiêu.", "label": 1},
  {"text": "Tôm thẻ bị phân trắng, đường ruột rỗng; đã giảm thức ăn 20% và tạt vi sinh 2 lần. Bạn lập quy trình kiểm tra nguyên nhân và hướng xử lý an toàn.", "label": 1},
  {"text": "Lúa 40 ngày bị rầy nâu mật độ cao, ruộng 3ha. Xin hướng dẫn IPM, ngưỡng phun, và kế hoạch giảm kháng thuốc.", "label": 1},
  {"text": "Sầu riêng giai đoạn ra hoa, bông rụng nhiều sau mưa; mình phun Canxi-Bo 2 lần/tuần. Xin tư vấn điều chỉnh dinh dưỡng và quản lý nước 14 ngày.", "label": 1},
  {"text": "Gà 35 ngày tuổi chết rải rác, mổ thấy xuất huyết manh tràng. Xin tư vấn nghi cầu trùng và phác đồ + vệ sinh chuồng.", "label": 1},
  {"text": "Chuồng heo 40 con mùi amoniac nặng, nền ướt; mình dùng men vi sinh nhưng hiệu quả thấp. Xin quy trình cải thiện thông thoáng + xử lý nền theo tuần.", "label": 1},
  {"text": "Thiết kế hệ thống tưới nhỏ giọt cho 2ha xoài: tính công suất bơm, đường kính ống, lưu lượng từng khu, và dự toán chi phí.", "label": 1},
  {"text": "Lập kế hoạch kinh doanh 12 tháng cho mô hình nuôi cá rô phi RAS: CAPEX/OPEX, điểm hòa vốn, rủi ro, KPI vận hành.", "label": 1},
  {"text": "Phân tích biến đổi khí hậu ảnh hưởng năng suất lúa và đề xuất chiến lược thích ứng cho nông hộ nhỏ.", "label": 1},

  {"text": "viết code python để đọc file csv và vẽ biểu đồ", "label": 0},
  {"text": "làm sao sửa lỗi ModuleNotFoundError trong python", "label": 0},
  {"text": "tối ưu query SQL cho bảng 10 triệu dòng", "label": 0},
  {"text": "viết API bằng NodeJS và Express", "label": 0},
  {"text": "cách deploy docker lên kubernetes", "label": 0},
  {"text": "giải thích thuật toán Dijkstra", "label": 0},
  {"text": "tư vấn pháp lý về hợp đồng thuê đất", "label": 0},
  {"text": "tôi nên mua cổ phiếu nào trong năm nay?", "label": 0},
  {"text": "đau ngực khó thở nên làm gì", "label": 0},
  {"text": "xem tử vi cung hoàng đạo", "label": 0}
]
